In [2]:
#Pandas is a package for data manipulation and analysis in Python. The name Pandas is derived from the 
#econometrics term Panel Data. Pandas incorporates two additional data structures into Python, namely 
#Pandas Series and Pandas DataFrame. These data structures allow us to work with labeled and relational data 
#in an easy and intuitive manner. 
!conda list pandas   # or conda list pandas   -in anaconda prompt
!conda list numpy    # or conda list numpy    -in anaconda prompt

#Below are just a few features that makes Pandas an excellent package for data analysis:

#1. Allows the use of labels for rows and columns
#2. Can calculate rolling statistics on time series data
#3. Easy handling of NaN values
#4. Is able to load data of different formats into DataFrames
#5. Can join and merge different datasets together
#6. It integrates with NumPy and Matplotlib
# For these and other reasons, Pandas DataFrames have become one of the most commonly used Pandas object for 
# data analysis in Python.

# packages in environment at C:\Users\POSIVA\AppData\Local\Continuum\anaconda3:
#
# Name                    Version                   Build  Channel
pandas                    0.23.4           py37h830ac7b_0
# packages in environment at C:\Users\POSIVA\AppData\Local\Continuum\anaconda3:
#
# Name                    Version                   Build  Channel
numpy                     1.15.1           py37ha559c80_0
numpy-base                1.15.1           py37h8128ebf_0
numpydoc                  0.8.0                    py37_0

In [81]:
#creating Pandas series
import pandas as pd

In [56]:
groceries = pd.Series(data=[30, 6, 'Yes', 'No'], index=['eggs', 'apples', 'milk', 'bread']) 
print(groceries)
#A Panda series is a one dimensional array like object that can hold many data types, 
#such as numbers and strings. This is different from NumPy array which can hold only one data type. Another big
#difference between Pandas series and NumPy array is that you can assign an index label to each element in the
#pandas series

#For the above example groceries Series , we will use food names as index labels and the quantites we need to buy
#as our data. We can see that pandas series is displayed with the indices in the first column and the data in 
#second column. Notice that the data is not indexed zero to three, but rather with the names of the foods that
#we put in, eggs, apples, milk, bread. Pandas also have attributes similar to NumPy that can provide some of the 
#properties like shape, ndim
print('Shape:',groceries.shape) #shape gives us the sizes of each dimension of the data
print('ndim:',groceries.ndim)   #ndim gives us the number of dimensions of the data
print('Size:',groceries.size)   #size gives us the total number of values in the array 
print('Indices:',groceries.index) #index gives us the index labels of the series object
print('Data:',groceries.values) #values gives us the data into the series object
print('Type:',type(groceries))

#if you are unsure whether an index label exists, you can always check using the in command
print('banana' in groceries) #banana is not in groceries labels, so it returns False
print('bread'  in groceries)

eggs       30
apples      6
milk      Yes
bread      No
dtype: object
Shape: (4,)
ndim: 1
Size: 4
Indices: Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')
Data: [30 6 'Yes' 'No']
Type: <class 'pandas.core.series.Series'>
False
True

In [57]:
#Accessing and deleting elements in Pandas Series
print('number of eggs:',groceries['eggs'])  #accessing elements with label indices
print('Milk and bread:\n', groceries[['milk','bread']]) #accessing data with multiple labels
print('First item:',groceries[0])
print('Last item:',groceries[-1])
print('Multiple items:\n',groceries[[0,1]])

number of eggs: 30
Milk and bread:
 milk     Yes
bread     No
dtype: object
First item: 30
Last item: No
Multiple items:
 eggs      30
apples     6
dtype: object

In [58]:
#In order to remove any ambiguity from rather  we're referring to an index label or a numerical index. Pandas Series
#have 2 attributes loc and iloc to explicitly state what we mean. The attribute loc stands for a location, and it's
#used to explicitly state that we're using a labelled index. Similarly the attribute iloc stands for integer location
#and is used to explicitly state that we're using a numerical index. Pandas series are also mutable like numpy arrays
print('loc:\n',groceries.loc[['eggs','apples']])
print('iloc:\n',groceries.iloc[[2,3]])
print('\ngroceries:\n',groceries)
groceries['eggs'] = 2  #modifying the data in Pandas Series
print(groceries)

print('drop apples:\n',groceries.drop('apples')) #drop function used to delete the data related to the passed label 
#in Pandas series. However this drops elements from the series out of place. Meaning up here this just returned
#the modified series, and didn't actually change the original one as you can see below.
print('\n',groceries) #still apples label is present in pandas series
#We can make this happen inplace, and change the original series by setting the parameter inplace to True. 
print('Inplace drop apples:\n',groceries.drop('apples', inplace=True))
print(groceries)

loc:
 eggs      30
apples     6
dtype: object
iloc:
 milk     Yes
bread     No
dtype: object

groceries:
 eggs       30
apples      6
milk      Yes
bread      No
dtype: object
eggs        2
apples      6
milk      Yes
bread      No
dtype: object
drop apples:
 eggs       2
milk     Yes
bread     No
dtype: object

 eggs        2
apples      6
milk      Yes
bread      No
dtype: object
Inplace drop apples:
 None
eggs       2
milk     Yes
bread     No
dtype: object

In [60]:
#Arthimetic operations on Pandas series -Element-wise arthimetic operations on Pandas series
fruits = pd.Series([10,6,3],['apples','oranges','banana'])
print('fruits:\n',fruits)

fruits:
 apples     10
oranges     6
banana      3
dtype: int64

In [61]:
fruits + 2

apples     12
oranges     8
banana      5
dtype: int64

In [62]:
fruits - 2

apples     8
oranges    4
banana     1
dtype: int64

In [63]:
fruits * 2

apples     20
oranges    12
banana      6
dtype: int64

In [64]:
fruits / 2

apples     5.0
oranges    3.0
banana     1.5
dtype: float64

In [65]:
#We can also apply mathematical functions from numpy
import numpy as np
print(fruits)
np.sqrt(fruits)

apples     10
oranges     6
banana      3
dtype: int64

apples     3.162278
oranges    2.449490
banana     1.732051
dtype: float64

In [66]:
np.exp(fruits)  # E^fruit elements ...here E value is 2.71828

apples     22026.465795
oranges      403.428793
banana        20.085537
dtype: float64

In [67]:
np.power(fruits,2)

apples     100
oranges     36
banana       9
dtype: int64

In [69]:
#Also we can apply arthimetic operations on selected items from Pandas series
print(fruits)
fruits['banana'] + 2

apples     10
oranges     6
banana      3
dtype: int64

5

In [70]:
fruits.iloc[0] - 2

8

In [71]:
fruits [['apples', 'oranges']] * 2

apples     20
oranges    12
dtype: int64

In [72]:
fruits.loc [['apples','oranges']] / 2

apples     5.0
oranges    3.0
dtype: float64

In [74]:
#Arthimetic operations on a Pandas series which has elements of different data types
items = pd.Series([30, 6, 'Yes', 'No'],['eggs', 'apples', 'milk', 'bread'])
items

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [76]:
items * 2  #multiplication apply on both integer and string data types, but if you apply division on this series,
#it would result an error. So, before applying any arthimetic operator make sure that operation performs on all
#elements in the Pandas series

eggs          60
apples        12
milk      YesYes
bread       NoNo
dtype: object

In [79]:
import pandas as pd

# Create a Pandas Series that contains the distance of some planets from the Sun.
# Use the name of the planets as the index to your Pandas Series, and the distance
# from the Sun as your data. The distance from the Sun is in units of 10^6 km

distance_from_sun = [149.6, 1433.5, 227.9, 108.2, 778.6]

planets = ['Earth','Saturn', 'Mars','Venus', 'Jupiter']

# Create a Pandas Series using the above data, with the name of the planets as
# the index and the distance from the Sun as your data.
dist_planets = pd.Series(distance_from_sun, planets)
print('dist planets:\n',dist_planets)
# Calculate the number of minutes it takes sunlight to reach each planet. You can
# do this by dividing the distance from the Sun for each planet by the speed of light.
# Since in the data above the distance from the Sun is in units of 10^6 km, you can
# use a value for the speed of light of c = 18, since light travels 18 x 10^6 km/minute.
time_light = dist_planets / 18 
print('time light:\n',time_light)
# Use Boolean indexing to select only those planets for which sunlight takes less
# than 40 minutes to reach them.
close_planets = time_light[time_light < 40]
print('close planets:\n',close_planets)

dist planets:
 Earth       149.6
Saturn     1433.5
Mars        227.9
Venus       108.2
Jupiter     778.6
dtype: float64
time light:
 Earth       8.311111
Saturn     79.638889
Mars       12.661111
Venus       6.011111
Jupiter    43.255556
dtype: float64
close planets:
 Earth     8.311111
Mars     12.661111
Venus     6.011111
dtype: float64

In [85]:
#Second main data structure in Pandas is a DataFrame which is a two dimensional object with labeld rows and columns
# and also can hold multiple data types- Similar to powefull excel spread sheet. We can create Pandas DataFrame 
#manually or by loading data from a file
#Creating a Pandas DataFrame manually from a dictionary containing several Pandas Series
items = {'Bob' : pd.Series([245,25,55],['bike','pants','watch']),
          'Alice': pd.Series([40,110,500,45],['book','glasses','bike','pants'])}
print('type:',type(items))
print(items)

type: <class 'dict'>
{'Bob': bike     245
pants     25
watch     55
dtype: int64, 'Alice': book        40
glasses    110
bike       500
pants       45
dtype: int64}

In [89]:
shopping_carts = pd.DataFrame(items) #notice that the row labels of the DataFrame are built from the union of the
#index labels we provided in the series
print('DataFrame:\n',shopping_carts)
#Whenever a DataFrame is created, if a particular column doesn't have values for a particular index, Pandas will 
#put NaN (not a number) there

DataFrame:
            Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [92]:
#Create the DataFrame with out labels in series, so taht Pandas automatically assign numerical indices to the rows
data = {'Bob' : pd.Series([245,25,55]),
          'Alice': pd.Series([40,110,500,45])}
print('type:',type(data))
print(data)
df = pd.DataFrame(data)
print(df)

type: <class 'dict'>
{'Bob': 0    245
1     25
2     55
dtype: int64, 'Alice': 0     40
1    110
2    500
3     45
dtype: int64}
     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [93]:
#Extract informatio from a DataFrame using Attributes
shopping_carts.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [96]:
shopping_carts.columns

Index(['Bob', 'Alice'], dtype='object')

In [94]:
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [98]:
shopping_carts.shape

(5, 2)

In [99]:
shopping_carts.ndim

2

In [97]:
shopping_carts.size

10

In [100]:
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [102]:
sel_shopping_cart = pd.DataFrame(items, columns=['Alice'], index=['pants','book'])
sel_shopping_cart

       Alice
pants     45
book      40

In [111]:
#manually create DataFrames from a dictionary of lists (arrays). The procedure is the same as before, 
#we start by creating the dictionary and then passing the dictionary to the pd.DataFrame() function. 
#In this case, however, all the lists (arrays) in the dictionary must be of the same length. 

data1 = {'integers': [1,2,3,4,5],
         'floats' : [1.23,2.34,3.45,4.56,5.67]}
df1 = pd.DataFrame(data1)  #assign indices with default numerical values
df1

   integers  floats
0         1    1.23
1         2    2.34
2         3    3.45
3         4    4.56
4         5    5.67

In [106]:
#We can also add labels while creating dataframe
df2 = pd.DataFrame(data1, index=['label1','label2','label3','label4','label5'])
df2

        integers  floats
label1         1    1.23
label2         2    2.34
label3         3    3.45
label4         4    4.56
label5         5    5.67

In [29]:
#Another way to create a DataFrame is passing input as list of dictionaries
data2 = [{'bikes': 20, 'pants': 30, 'watches': 35},{'watches' : 10, 'glasses' : 50, 'bikes': 15, 'pants': 5}]
store_items = pd.DataFrame(data2, index=['store1','store2'])
store_items

        bikes  glasses  pants  watches
store1     20      NaN     30       35
store2     15     50.0      5       10

In [189]:
#Accessing elements in Pandas DataFrame
store_items

        bikes  glasses  pants  watches
store1     20      NaN     30       35
store2     15     50.0      5       10

In [190]:
store_items[['bikes']]

        bikes
store1     20
store2     15

In [191]:
store_items[['bikes','pants']]

        bikes  pants
store1     20     30
store2     15      5

In [192]:
store_items.loc[['store1']]

        bikes  glasses  pants  watches
store1     20      NaN     30       35

In [34]:
store_items.iloc[[0]]

        bikes  glasses  pants  watches
store1     20      NaN     30       35

In [193]:
store_items['bikes']['store2']  #column label first and then row lable similar to excel spread sheet A1, B2 cellsb

15

In [194]:
#Adding a new column to the existing data frame
store_items['shirts'] = [15,2]
store_items

        bikes  glasses  pants  watches  shirts
store1     20      NaN     30       35      15
store2     15     50.0      5       10       2

In [195]:
#We can also create a new column by doing some arthimetic operations on existing columns
store_items['suits'] = store_items['shirts'] + store_items['pants']
store_items

        bikes  glasses  pants  watches  shirts  suits
store1     20      NaN     30       35      15     45
store2     15     50.0      5       10       2      7

In [196]:
#If we want to add a new row to the existing DataFrame, first create a data frame with the provided values for 
#all columns in a new row and append this new data frame to the existing data frame.
new_item = [{'bikes':20,'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_item, index=['store3'])
new_store

        bikes  glasses  pants  watches
store3     20        4     30       35

In [197]:
store_items = store_items.append(new_store, sort=True)
store_items

        bikes  glasses  pants  shirts  suits  watches
store1     20      NaN     30    15.0   45.0       35
store2     15     50.0      5     2.0    7.0       10
store3     20      4.0     30     NaN    NaN       35

In [198]:
#Add a new column to the existing data frame
store_items['new_watches'] = store_items['watches'][1:]  #starting from index 1, so store1 new_watches = NaN
store_items

        bikes  glasses  pants  shirts  suits  watches  new_watches
store1     20      NaN     30    15.0   45.0       35          NaN
store2     15     50.0      5     2.0    7.0       10         10.0
store3     20      4.0     30     NaN    NaN       35         35.0

In [199]:
#It is also possible to insert new columns into the data frame anywhere we want. The Insert method allows us to 
#specify the location, label, data of the column we want to add.
#let's add shoe column right before the watches column
store_items.insert(5, 'shoes', [8,5,0])  #loc (location index), label, data
store_items

        bikes  glasses  pants  shirts  suits  shoes  watches  new_watches
store1     20      NaN     30    15.0   45.0      8       35          NaN
store2     15     50.0      5     2.0    7.0      5       10         10.0
store3     20      4.0     30     NaN    NaN      0       35         35.0

In [200]:
#deleting columns - pop and drop methods
#pop - method can be used to delete columns
#drop - method can be used to delete both rows and columns by using the axis keyword
store_items.pop('new_watches') #deleting the column 'new_watches'
store_items

        bikes  glasses  pants  shirts  suits  shoes  watches
store1     20      NaN     30    15.0   45.0      8       35
store2     15     50.0      5     2.0    7.0      5       10
store3     20      4.0     30     NaN    NaN      0       35

In [201]:
store_items = store_items.drop(['watches','shoes'], axis = 1) #axis = 1 columns
store_items

        bikes  glasses  pants  shirts  suits
store1     20      NaN     30    15.0   45.0
store2     15     50.0      5     2.0    7.0
store3     20      4.0     30     NaN    NaN

In [202]:
store_items = store_items.drop(['store1','store2'], axis = 0) #axis = 0 rows
store_items

        bikes  glasses  pants  shirts  suits
store3     20      4.0     30     NaN    NaN

In [203]:
#We can change the column label name using rename method
store_items = store_items.rename(columns = {'bikes':'hats'})  #changing column names :bikes to hats 
#here original value 'bikes' acts as a key and new value 'hats' acts as value in dictionary
store_items

        hats  glasses  pants  shirts  suits
store3    20      4.0     30     NaN    NaN

In [204]:
#we can also change the row labels names
store_items = store_items.rename(index = {'store3':'laststore'}) #changing the row label names
store_items

           hats  glasses  pants  shirts  suits
laststore    20      4.0     30     NaN    NaN

In [205]:
#We can also set the index (row labels) with the existing column values
store_items = store_items.set_index('pants')
store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN

In [36]:
#Dealing with NaN
#before we can begin training our learning algorithms with large datasets, we usually need to clean the data first.
#This means we need to have a method for detecting and correcting errors in our data. While any given dataset 
#can have many types of bad data, such as outliers or incorrect values, the type of bad data we encounter almost 
#always is missing values. As we saw earlier, Pandas assigns NaN values to missing data. In this lesson we will 
#learn how to detect and deal with NaN values.
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]
store_items2 = pd.DataFrame(items2, index=['store1','store2','store3'])
store_items2

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     NaN     10    NaN       35

In [242]:
#to count the total number of NaN values in a dataframe
a = store_items2.isnull().sum().sum() #this combines to isnull and sum methods to count the number of NaN values
#in a data frame
a

3

In [243]:
b = store_items2.isnull() #isnull() method returns a dataframe with a boolean for each value in the store
#items data frame. True when the value is NaN. Logical True values = 1, Logical False values = 0
print(b)
c = store_items2.isnull().sum() #sum() gives us a number of NaNs in each column
print('c:\n',c)
d = store_items2.isnull().sum().sum()
print('d:',d)

        bikes  glasses  pants  shirts  shoes  suits  watches
store1  False     True  False   False  False  False    False
store2  False    False  False   False  False  False    False
store3  False    False  False    True  False   True    False
c:
 bikes      0
glasses    1
pants      0
shirts     1
shoes      0
suits      1
watches    0
dtype: int64
d: 3

In [244]:
#count the number of non-NaN values with the count method
store_items2.count()

bikes      3
glasses    2
pants      3
shirts     2
shoes      3
suits      2
watches    3
dtype: int64

In [245]:
#We can delete columns or rows which are having NaN values using dropna function
#dropna method drops these rows or columns out of place, meaning the original dataframe is not modified
store_items2.dropna(axis = 0) #deleting all rows which are having NaN values

        bikes  glasses  pants  shirts  shoes  suits  watches
store2     15     50.0      5     2.0      5    7.0       10

In [246]:
store_items2.dropna(axis=1)

        bikes  pants  shoes  watches
store1     20     30      8       35
store2     15      5      5       10
store3     20     30     10       35

In [247]:
print(store_items2)  #dropna works out of place, if you want to do it in inplace use inplace = True

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     NaN     10    NaN       35

In [248]:
#store_items2.dropna(axis = 1, inplace = True)
store_items2.dropna(axis = 1)
store_items2

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     NaN     10    NaN       35

In [249]:
#let's replace NaN values with some values instead of removing those
store_items2.fillna(0) #replace all NaN values with zeros and it acts as out of place, if you want to modify the
#original data frame provide inplace = True

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      0.0     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     0.0     10    0.0       35

In [250]:
store_items2

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     NaN     10    NaN       35

In [251]:
#replace the NaN values with the previous row values using forward filling- ffill 
store_items2.fillna(method='ffill',axis = 0) #NaN values in store3 replaced with the previous row store2 values

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     2.0     10    7.0       35

In [252]:
store_items2

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     NaN     10    NaN       35

In [253]:
store_items2.fillna(method='ffill',axis=1)

        bikes  glasses  pants  shirts  shoes  suits  watches
store1   20.0     20.0   30.0    15.0    8.0   45.0     35.0
store2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store3   20.0      4.0   30.0    30.0   10.0   10.0     35.0

In [255]:
#Replace all NaNs with the values that go after then in a DataFrame, this is called backwards filling  and this 
#replaces each NaN value with the next values in that column
store_items2.fillna(method='backfill',axis=0)

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20     50.0     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     NaN     10    NaN       35

In [256]:
store_items2

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     NaN     10    NaN       35

In [37]:
#using interpolate function for replacing NaN values in a DataFrame
store_items2.interpolate(method = 'linear', axis = 0) #store3 NaN values replaced with Store2 values
#Store1 NaN values didn't replaces with any as there are no previous values to calculate values using interpolate

        bikes  glasses  pants  shirts  shoes  suits  watches
store1     20      NaN     30    15.0      8   45.0       35
store2     15     50.0      5     2.0      5    7.0       10
store3     20      4.0     30     2.0     10    7.0       35

In [258]:
store_items2.interpolate(method='linear', axis = 1)

        bikes  glasses  pants  shirts  shoes  suits  watches
store1   20.0     25.0   30.0    15.0    8.0   45.0     35.0
store2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store3   20.0      4.0   30.0    20.0   10.0   22.5     35.0

In [38]:
import pandas as pd
import numpy as np

# Since we will be working with ratings, we will set the precision of our 
# dataframes to one decimal place.
pd.set_option('precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a
# series of books. The ratings given are in the range from 1 to 5, with 5 being
# the best score. The names of the books, the authors, and the ratings of each user
# are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

# Users that have np.nan values means that the user has not yet rated that book.
# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. Let Pandas
# automatically assign numerical row indices to the DataFrame. 

# Create a dictionary with the data given above
dat = {'Book Title' : books,
       'Author'     : authors,
       'User 1'     : user_1,
       'User 2'     : user_2,
       'User 3'     : user_3,
       'User 4'     : user_4
       }

# Use the dictionary to create a Pandas DataFrame
book_ratings = pd.DataFrame(dat)
print(book_ratings)
# If you created the dictionary correctly you should have a Pandas DataFrame
# that has column labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3',
# 'User 4' and row indices 0 through 4.

# Now replace all the NaN values in your DataFrame with the average rating in
# each column. Replace the NaN values in place. HINT: you can use the fillna()
# function with the keyword inplace = True, to do this. Write your code below:
book_ratings.fillna(book_ratings.mean(), inplace = True)
print('\n',book_ratings)

            Book Title               Author  User 1  User 2  User 3  User 4
0   Great Expectations      Charles Dickens     3.2     5.0     2.0     4.0
1      Of Mice and Men       John Steinbeck     NaN     1.3     2.3     3.5
2     Romeo and Juliet  William Shakespeare     2.5     4.0     NaN     4.0
3     The Time Machine          H. G. Wells     NaN     3.8     4.0     5.0
4  Alice in Wonderland        Lewis Carroll     NaN     NaN     NaN     4.2

             Book Title               Author  User 1  User 2  User 3  User 4
0   Great Expectations      Charles Dickens     3.2     5.0     2.0     4.0
1      Of Mice and Men       John Steinbeck     2.9     1.3     2.3     3.5
2     Romeo and Juliet  William Shakespeare     2.5     4.0     2.8     4.0
3     The Time Machine          H. G. Wells     2.9     3.8     4.0     5.0
4  Alice in Wonderland        Lewis Carroll     2.9     3.5     2.8     4.2

In [45]:
#best rated book title
best_rated = book_ratings[(book_ratings == 5).any(axis=1)]['Book Title'].values
best_rated
#The code above returns a NumPy ndarray that only contains the names of the books that had a rating of 5.

array(['Great Expectations', 'The Time Machine'], dtype=object)

In [4]:
#Loading Data into a pandas DataFrame -  Pandas allows us to load databases of different formats into data frames.
#most commonly used format is CSV (comma separated values)
import pandas as pd
google_stock = pd.read_csv('./goog-1.csv')

print(type(google_stock))
print(google_stock.shape)

<class 'pandas.core.frame.DataFrame'>
(3313, 7)

In [5]:
google_stock

,Date,Open,High,Low,Close,Adj Close,Volume
0,2004-08-19,49.676899,51.693783,47.669952,49.845802,49.845802,44994500
1,2004-08-20,50.178635,54.187561,49.925285,53.805050,53.805050,23005800
2,2004-08-23,55.017166,56.373344,54.172661,54.346527,54.346527,18393200
3,2004-08-24,55.260582,55.439419,51.450363,52.096165,52.096165,15361800
4,2004-08-25,52.140873,53.651051,51.604362,52.657513,52.657513,9257400
5,2004-08-26,52.135906,53.626213,51.991844,53.606342,53.606342,7148200
6,2004-08-27,53.700729,53.959049,52.503513,52.732029,52.732029,6258300
7,2004-08-30,52.299839,52.404160,50.675404,50.675404,50.675404,5235700
8,2004-08-31,50.819469,51.519913,50.749920,50.854240,50.854240,4954800
9,2004-09-01,51.018177,51.152302,49.512966,49.801090,49.801090,9206800
10,2004-09-02,49.274517,50.854240,49.150326,50.427021,50.427021,15232100
11,2004-09-03,50.148830,50.541279,49.339096,49.681866,49.681866,5191000
12,2004-09-07,50.178635,50.670437,49.483158,50.461796,50.461796,5891300
13,2004-09-08,50.044510,51.182110,49.925285,50.819469,50.819469,5023000
14,2004-09-09,50.933723,51.023144,50.173668,50.824436,50.824436,4092100
15,2004-09-10,50.471729,52.935703,50.322701,52.324677,52.324677,8764200
16,2004-09-13,52.970478,53.854729,52.886028,53.402668,53.402668,7902900
17,2004-09-14,53.377831,55.638126,53.049961,55.384777,55.384777,10910200
18,2004-09-15,54.922779,56.745922,54.743942,55.638126,55.638126,10793500
19,2004-09-16,55.807030,57.525848,55.464260,56.616764,56.616764,9335800
20,2004-09-17,56.840309,58.365391,56.408119,58.365391,58.365391,9543500
21,2004-09-20,58.097134,60.407108,58.007717,59.294346,59.294346,10708500
22,2004-09-21,59.517895,59.820923,58.375324,58.539257,58.539257,7282900
23,2004-09-22,58.320679,59.448345,58.027588,58.807514,58.807514,7638000
24,2004-09-23,59.036026,60.918781,58.131908,60.019630,60.019630,8599600
25,2004-09-24,60.079243,61.649033,59.493053,59.527828,59.527828,9191900
26,2004-09-27,59.393700,60.049435,58.519386,58.747902,58.747902,7119100
27,2004-09-28,60.258080,63.288372,59.716602,63.020115,63.020115,17056100
28,2004-09-29,62.940632,67.073753,62.707150,65.116478,65.116478,30745600
29,2004-09-30,64.530296,65.722542,64.083199,64.381264,64.381264,13861300
...,...,...,...,...,...,...,...
3283,2017-09-01,941.130005,942.479980,935.150024,937.340027,937.340027,947400
3284,2017-09-05,933.080017,937.000000,921.960022,928.450012,928.450012,1326400
3285,2017-09-06,930.150024,930.914978,919.270020,927.809998,927.809998,1527700
3286,2017-09-07,931.729980,936.409973,923.619995,935.950012,935.950012,1212700
3287,2017-09-08,936.489990,936.989990,924.880005,926.500000,926.500000,1011500
3288,2017-09-11,934.250000,938.380005,926.919983,929.080017,929.080017,1267000
3289,2017-09-12,932.590027,933.479980,923.861023,932.070007,932.070007,1134400
3290,2017-09-13,930.659973,937.250000,929.859985,935.090027,935.090027,1102600
3291,2017-09-14,931.250000,932.770020,924.000000,925.109985,925.109985,1397600
3292,2017-09-15,924.659973,926.489990,916.359985,920.289978,920.289978,2505400
3293,2017-09-18,920.010010,922.080017,910.599976,915.000000,915.000000,1306900
3294,2017-09-19,917.419983,922.419983,912.549988,921.809998,921.809998,936700
3295,2017-09-20,922.979980,933.880005,922.000000,931.580017,931.580017,1669800
3296,2017-09-21,933.000000,936.530029,923.830017,932.450012,932.450012,1290600
3297,2017-09-22,927.750000,934.729980,926.479980,928.530029,928.530029,1052700
3298,2017-09-25,925.450012,926.400024,909.700012,920.969971,920.969971,1856800
3299,2017-09-26,923.719971,930.820007,921.140015,924.859985,924.859985,1666900
3300,2017-09-27,927.739990,949.900024,927.739990,944.489990,944.489990,2239400
3301,2017-09-28,941.359985,950.690002,940.549988,949.500000,949.500000,1020300
3302,2017-09-29,952.000000,959.786011,951.510010,959.109985,959.109985,1581000
3303,2017-10-02,959.979980,962.539978,947.840027,953.270020,953.270020,1283400
3304,2017-10-03,954.000000,958.000000,949.140015,957.789978,957.789978,888300
3305,2017-10-04,957.000000,960.390015,950.690002,951.679993,951.679993,952400
3306,2017-10-05,955.489990,970.909973,955.179993,969.960022,969.960022,1213800
3307,2017-10-06,966.700012,979.460022,963.359985,978.890015,978.890015,1173900
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

In [7]:
google_stock.head()  #head() method provides first 5 rows of he data set, head(10)-first 10 rows

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
3  2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
4  2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400

In [8]:
google_stock.tail() #tail() method provides last 5 rows of the data set
#we can also provide integer as an argument like tail(10), last 10 rows

,Date,Open,High,Low,Close,Adj Close,Volume
3308,2017-10-09,980.000000,985.424988,976.109985,977.000000,977.000000,891400
3309,2017-10-10,980.000000,981.570007,966.080017,972.599976,972.599976,968400
3310,2017-10-11,973.719971,990.710022,972.250000,989.250000,989.250000,1693300
3311,2017-10-12,987.450012,994.119995,985.000000,987.830017,987.830017,1262400
3312,2017-10-13,992.000000,997.210022,989.000000,989.679993,989.679993,1157700

In [12]:
google_stock.isnull().any()  #any() method to check whether any of the columns contain none values

Date         False
Open         False
High         False
Low          False
Close        False
Adj Close    False
Volume       False
dtype: bool

In [13]:
#Pandas provides a describe method which returns descriptive statistics on each column of the data frame.
google_stock.describe()

,Open,High,Low,Close,Adj Close,Volume
count,3313.000000,3313.000000,3313.000000,3313.000000,3313.000000,3.313000e+03
mean,380.186092,383.493740,376.519309,380.072458,380.072458,8.038476e+06
std,223.818650,224.974534,222.473232,223.853780,223.853780,8.399521e+06
min,49.274517,50.541279,47.669952,49.681866,49.681866,7.900000e+03
25%,226.556473,228.394516,224.003082,226.407440,226.407440,2.584900e+06
50%,293.312286,295.433502,289.929291,293.029114,293.029114,5.281300e+06
75%,536.650024,540.000000,532.409973,536.690002,536.690002,1.065370e+07
max,992.000000,997.210022,989.000000,989.679993,989.679993,8.276810e+07

In [14]:
#We can also apply describe method on single column
google_stock['Adj Close'].describe()

count    3313.000000
mean      380.072458
std       223.853780
min        49.681866
25%       226.407440
50%       293.029114
75%       536.690002
max       989.679993
Name: Adj Close, dtype: float64

In [16]:
#We can also apply individual statistical method on data frame
google_stock.max() #provides maximum value in each column

Date         2017-10-13
Open                992
High             997.21
Low                 989
Close            989.68
Adj Close        989.68
Volume         82768100
dtype: object

In [17]:
google_stock.mean() #provides mean value of each column

Date         0.000000e+00
Open         0.000000e+00
High         0.000000e+00
Low          0.000000e+00
Close        0.000000e+00
Adj Close    0.000000e+00
Volume       8.038476e+06
dtype: float64

In [19]:
google_stock['Close'].min() #provides minimum value in column Close

49.681866

In [21]:
#Another important statistical measure is data correlation. We can use the core() method to get the correlation
#between different columns
google_stock.corr()

               Open      High       Low     Close  Adj Close    Volume
Open       1.000000  0.999904  0.999845  0.999745   0.999745 -0.564258
High       0.999904  1.000000  0.999834  0.999868   0.999868 -0.562749
Low        0.999845  0.999834  1.000000  0.999899   0.999899 -0.567007
Close      0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Adj Close  0.999745  0.999868  0.999899  1.000000   1.000000 -0.564967
Volume    -0.564258 -0.562749 -0.567007 -0.564967  -0.564967  1.000000

In [22]:
#group by method- which allows us to group data to get the different types of information
data1 = pd.read_csv('./fake_company.csv')
data1

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991    Alice         HR   26   52000
4  1991      Bob         RD   31   50000
5  1991  Charlie      Admin   46   60000
6  1992    Alice      Admin   27   60000
7  1992      Bob         RD   32   52000
8  1992  Charlie      Admin   28   62000

In [24]:
#Let's use the groupby() method to get information. Let's calculate how much money the company spent on salaries 
#each year. To do this we will group the data by year and then add up the salaries of all of the employees with 
#the sum method.
data1.groupby(['Year'])['Salary'].sum() #the company spent a total of 1,53,000 in 1990: 1,62,000 in 1991 :
#1,74,000 in 1992

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [25]:
#Average salaries for each year
data1.groupby(['Year'])['Salary'].mean()

Year
1990    51000
1991    54000
1992    58000
Name: Salary, dtype: int64

In [26]:
#Let's see how much in total each employee got paid during those 3 years
data1.groupby(['Name'])['Salary'].sum()

Name
Alice      162000
Bob        150000
Charlie    177000
Name: Salary, dtype: int64

In [27]:
#Salary distribution per department was per year
data1.groupby(['Department','Year'])['Salary'].sum()

Department  Year
Admin       1990     55000
            1991     60000
            1992    122000
HR          1990     50000
            1991     52000
RD          1990     48000
            1991     50000
            1992     52000
Name: Salary, dtype: int64